tsharkMqtt/xmls/mqtt.xml
<?xml version='1.0'?>
 
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel='notice' version='1.0'>
   	 <clients>
       	     <client host='zhilu' maxusers='40000'>
   	     	<ip value='192.168.10.31'/>
 	     </client> 
   	 </clients>
	<servers>
              <server host='192.168.10.200' port='1883' type='tcp'/>
	</servers>

    <load>
	         <arrivalphase duration='60' phase='1' unit='second'> 
			<session_setup name='mqtt_subscriber' probability='100'/> 
			<session_setup name='mqtt_publisher' probability='0'/> 
			<users arrivalrate='50' maxnumber='1200' unit='second'/> 
		 </arrivalphase> 
		 
		 <arrivalphase duration='60' phase='2' unit='second'> 
			<session_setup name='mqtt_subscriber' probability='0'/> 
			<session_setup name='mqtt_publisher' probability='100'/> 
			<users arrivalrate='50' maxnumber='1200' unit='second'/> 
		</arrivalphase> 
    </load>

    <options>
		<option max='65535' min='1025' name='ports_range'/>		
		<option id='subcsv' name='file_server' value='./csvs/sub.csv'/>		
		<option id='pubcsv' name='file_server' value='./csvs/pub.csv'/>
   </options>
 			
    <sessions> 	
	
		<session name='mqtt_publisher' probability='50' type='ts_mqtt'>			 
			<setdynvars delimiter=',' fileid='pubcsv' order='iter' sourcetype='file'>
				<var name='pubid'/>
				<var name='pubtopic'/>
				<var name='pubmsg'/>
			</setdynvars>
			
			<request subst='true'>
				<mqtt clean_start='true' client_id='%%_pubid%%' password='mqttclient' type='connect' username='mqttclient'/>
			</request>           
				
			<request subst='true'>
				<mqtt topic='%%_pubtopic%%' type='publish'>%%_pubmsg%%</mqtt>
			</request>
			
           	<request>
               		 <mqtt type='disconnect'/>
           	</request>
       	</session>

 		<session name='mqtt_subscriber' probability='50' type='ts_mqtt'>
		
			<setdynvars delimiter=',' fileid='subcsv' order='iter' sourcetype='file'>
				<var name='subid'/>
				<var name='subtopic'/>
			</setdynvars>
	
			<request subst='true'>
				<mqtt clean_start='true' client_id='%%_subid%%' keepalive='60' password='mqttclient' type='connect' username='mqttclient'/>
			</request>

			<request subst='true'>
				<mqtt topic='%%_subtopic%%' type='subscribe'/>
			</request>
				
			<!-- <thinktime value="0.5"></thinktime -->
			
			<request>
				<!-- wait for 60s -->
				<mqtt timeout='150' type='waitForMessages'/>
			</request>

			<!-- <request subst="true"> -->
				<!-- <mqtt type="unsubscribe" topic="%%_subtopic%%"></mqtt> -->
			<!-- </request> -->

			<request>
				<mqtt type='disconnect'/>
			</request>
			
        </session>	
	
    </sessions>
</tsung>