tsharkMqtt/xmls/mqtt_onePair.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="zhilu-ubuntu01" maxusers="1000" use_controller_vm="true"></client>
    </clients>

	<servers>
       <server host="192.168.10.8" port="1883" type="tcp" />
	</servers>

    <load>
	    <!--单个用户 -->
		<user session="mqtt_subscriber" start_time="5" unit="second"></user> 		 	 
		<user session="mqtt_publisher" start_time="10" unit="second"></user> 
		<!--用户组 -->
		 <!-- <arrivalphase phase="2" duration="20" unit="second">  -->
		    <!-- session_setup覆盖session中的配置 -->
		    <!-- <session_setup name="http_test_1" probability="80"/> -->
			<!-- <session_setup name="fake"        probability="20"/> -->
			<!-- <users  interarrival="1" unit="second"/> -->
			<!-- 限定最大用户数量和创建用户速率 -->
			<!-- <users maxnumber="100" arrivalrate="50" unit="second"/>  -->
	     <!-- </arrivalphase>		  -->
    </load>

	<options>
	    <!--端口范围-->		
		<option name="ports_range" min="1025" max="65535"/>
		<!--全局requests之间的间隔，如果override为true会覆盖session中的thinktime-->
		<!-- <option name="thinktime" value="3" random="false" override="true"/> -->
	</options>
			
    <sessions>
        <session name="mqtt_subscriber1" probability="50" type="ts_mqtt">
				<!--设置连接超时-->
			    <!-- <set_option name="connect_timeout" value="1000" /> -->
				<request subst="true">
					<mqtt type="connect" clean_start="true" keepalive="60" username="mqttclient" password="mqttclient" client_id="tsungSub1"></mqtt>
				</request>			
		
				<request subst="true">
					<mqtt type="subscribe" topic="test_topic"></mqtt>
				</request>					
				<!-- <thinktime value="0.5"></thinktime -->				
				<request>
					<!-- wait for 60s -->
					<mqtt type="waitForMessages" timeout="60"></mqtt>
				</request>

				<!-- <request subst="true"> -->
					<!-- <mqtt type="unsubscribe" topic="test_topic1"></mqtt> -->
				<!-- </request> -->
				
				<request>
					<mqtt type="disconnect"></mqtt>
				</request>					
        </session>		
		
		<session name="mqtt_publisher" probability="50" type="ts_mqtt">		  
				<request subst="true">
					<mqtt type="connect" clean_start="true" username="mqttclient" password="mqttclient" client_id="tsungPub1"></mqtt>
				</request>           
					
				<request subst="true">
					<mqtt type="publish" topic="test_topic">hello</mqtt>
				</request>
				
				<request>
					<mqtt type="disconnect"></mqtt>
				</request>
        </session>
	
    </sessions>
</tsung>